
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры


&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	ДанныеКлиента = Новый Массив();
	
	ДанныеКлиента.Добавить(Объект.Фамилия);
	ДанныеКлиента.Добавить(Объект.Имя);
	ДанныеКлиента.Добавить(Объект.Отчество);
	
	Объект.Наименование = СтрСоединить(ДанныеКлиента, " ");
		
КонецПроцедуры 

#КонецОбласти
