
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильмПриИзменении(Элемент)
	
	Наименование = СформироватьНаименование(Объект.Фильм);
	Объект.Наименование = Наименование;
	Объект.ПолноеНаименование = Наименование;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	Наименование = СформироватьНаименование(Объект.Фильм);
	Объект.Наименование = Наименование;
	Объект.ПолноеНаименование = Наименование;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьНаименование(Фильм)
	
	СтрокаВозврат = "";
	
	Результат = Новый Массив();
	
	Если ЗначениеЗаполнено(Объект.Фильм)
		И Объект.ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Билет") Тогда
		
		Результат.Добавить(НСтр("ru = 'Билет на'"));
		Результат.Добавить(Объект.Фильм);
		
		СтрокаВозврат = СтрСоединить(Результат, " ");
		
	КонецЕсли;
	
	Возврат СтрокаВозврат;
	
КонецФункции

#КонецОбласти
