
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КинозалПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Фильм) Тогда

		ВремяФильма = ДлительностьФильма(Объект.Фильм);
		
		Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
			
			//@skip-check use-non-recommended-method
			Объект.ДатаНачала = НачалоДня(ТекущаяДата()) + 3600 * 12;
			
		КонецЕсли;
		
		Объект.ДатаОкончания = Объект.ДатаНачала + ВремяФильма * 60;

	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДлительностьФильма(Фильм)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Фильмы.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Фильм);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Длительность;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти
